# To install all applications and dependencies listed in this file, run:
# brew bundle

# To dump your current Homebrew setup to a Brewfile, run:
# brew bundle dump

# Taps (Homebrew repositories)
# Uncomment if you use any cask applications

# Core Homebrew packages
cask "1password-cli"
cask "basictex"
cask "ghostty"
brew "bat"
brew "bottom"
brew "carapace"
brew "cmake"
brew "doggo"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fish"
brew "fzf"
brew "git"
brew "git-delta"
brew "glow"
brew "gs"
brew "hg"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lcdf-typetools"
brew "libgit2"
brew "luacheck"
brew "mercurial"
brew "mosh"
brew "neovim"
brew "node"
brew "pandoc"
brew "poppler"
brew "presenterm"
brew "procs"
brew "python3"
brew "ripgrep"
brew "selene"
brew "shellcheck"
brew "starship"
brew "stow"
brew "stylua"
brew "tealdeer"
brew "tree"
brew "tree-sitter-cli"
brew "unar"
brew "viu"
brew "vivid"
brew "wget"
brew "xh"
brew "zoxide"
brew "zsh-syntax-highlighting"
